//
// Generated with FrostbiteGen by Chod
// File: SDK\Mat4.h
// Created: Wed Mar 10 19:06:03 2021
//

#ifndef FBGEN_Mat4_H
#define FBGEN_Mat4_H

struct Mat4
{
	static void* GetTypeInfo()
	{
		return (void*)0x00000001420F21F8;
	}
	float m_m11; // 0x0
	float m_m12; // 0x4
	float m_m13; // 0x8
	float m_m14; // 0xc
	float m_m21; // 0x10
	float m_m22; // 0x14
	float m_m23; // 0x18
	float m_m24; // 0x1c
	float m_m31; // 0x20
	float m_m32; // 0x24
	float m_m33; // 0x28
	float m_m34; // 0x2c
	float m_m41; // 0x30
	float m_m42; // 0x34
	float m_m43; // 0x38
	float m_m44; // 0x3c
}; // size = 0x40

#endif // FBGEN_Mat4_H
