//
// Generated with FrostbiteGen by Chod
// File: SDK\PamUITransformData.h
// Created: Wed Mar 10 19:03:22 2021
//

#ifndef FBGEN_PamUITransformData_H
#define FBGEN_PamUITransformData_H

struct PamUITransformData
{
	static void* GetTypeInfo()
	{
		return (void*)0x0000000142888820;
	}
	float m_Translate_X; // 0x0
	float m_Translate_Y; // 0x4
	float m_Translate_Z; // 0x8
	float m_Scale_X; // 0xc
	float m_Scale_Y; // 0x10
	float m_Scale_Z; // 0x14
	float m_Rotate_X; // 0x18
	float m_Rotate_Y; // 0x1c
	float m_Rotate_Z; // 0x20
}; // size = 0x24

#endif // FBGEN_PamUITransformData_H
