//
// Generated with FrostbiteGen by Chod
// File: SDK\PlatformScalableInt.h
// Created: Wed Mar 10 19:03:06 2021
//

#ifndef FBGEN_PlatformScalableInt_H
#define FBGEN_PlatformScalableInt_H

struct PlatformScalableInt
{
	static void* GetTypeInfo()
	{
		return (void*)0x00000001427B3128;
	}
	int m_Default; // 0x0
	int m_Xenon; // 0x4
	int m_Ps3; // 0x8
	int m_Gen4a; // 0xc
	int m_Gen4b; // 0x10
	int m_Android; // 0x14
	int m_iOS; // 0x18
	int m_OSX; // 0x1c
	int m_Linux; // 0x20
}; // size = 0x24

#endif // FBGEN_PlatformScalableInt_H
